// js Оператори
/*
АРИФМЕТИЧНІ ОПЕРАТОРИ
+, -, /,
% - часка від ділення (5%2 = 1)
** - підносити до степеня

ОПЕРАТОРИ РІВНОСТІ(ПРИСВОЮВАННЯ)
=, '5' ==  - не строга рівність, === - строга рівність
! - заперечення
!= - не дорівнює
!== - строга недорівнює
<, >, <=, >= - рівність завжди йде з правого боку
&&, || - логічне і або логічне або

ІНКРЕМЕНТ ТА ДЕКРЕМЕНТ
(i++ - пізніше ++i - відразу) - збільшення на одиницю (постфікс - префікс)
(і-- --і)
n = n + 5 - => n+=5, n-=5, n/=5, n%=5
(+?, -, !);  унарний оператор

let b = -10;
b = -b;

let q = '10';
n = +n
*/
// Оператор if
// if(умова) {
//  тіло умови	
//}


let q = 10;
if(q>=5) {
	console.log('yes');
}